In [82]:
# HW 1: How do you remove duplicate values in a dataset in Python?

In [92]:
# Remove duplicate data for a numpy array

import numpy as np
array=np.array([1,2,2,3,5,5,7])
print(array)

array_dedupe = np.unique(array)
print(array_dedupe)

[1 2 2 3 5 5 7]
[1 2 3 5 7]

In [110]:
# Remove duplicate rows for a dataframe
import pandas as pd
df=pd.DataFrame([[1,1,3],[2,2,4],[2,2,4]])
df

   0  1  2
0  1  1  3
1  2  2  4
2  2  2  4

In [111]:
df_dedupe = df.drop_duplicates()
df_dedupe

   0  1  2
0  1  1  3
1  2  2  4

In [113]:
# Remove duplicate columns for the dataframe
df.T.drop_duplicates().T

   0  2
0  1  3
1  2  4
2  2  4

In [121]:
# HW 2: frind request
import pandas as pd
friend_request=pd.DataFrame(
    {'receiver_id':[201,202,203],
     'requester_id':[101,102,103],
     'time':['2017-01-01','2017-01-02','2017-01-03']})

request_accepted=pd.DataFrame(
    {'requester_id':[101,103],
     'time':['2017-01-01','2017-01-04'],
     'acceptor_id':[201,203]})

print(friend_request)
print(request_accepted)

   receiver_id  requester_id        time
0          201           101  2017-01-01
1          202           102  2017-01-02
2          203           103  2017-01-03
   acceptor_id  requester_id        time
0          201           101  2017-01-01
1          203           103  2017-01-04

In [122]:
# SQL
# select count(if(ra.acceptor_id is null,'yes','no')='no')/count(*) as acceptance_rate 
# from friend_request fq left join request_accepted ra 
# on fq.requester_id = ra.requester_id
# and fq.receiver_id = ra.acceptor_id; 

merged_table = pd.merge(friend_request,request_accepted,how='left', left_on= ['requester_id','receiver_id'],
                       right_on=['requester_id','acceptor_id'])
merged_table

   receiver_id  requester_id      time_x  acceptor_id      time_y
0          201           101  2017-01-01        201.0  2017-01-01
1          202           102  2017-01-02          NaN         NaN
2          203           103  2017-01-03        203.0  2017-01-04

In [127]:
acceptance_rate = len(merged_table['acceptor_id'][merged_table.acceptor_id>0])/len(merged_table)
print(acceptance_rate)

0.6666666666666666

In [137]:
# HW 3: Credit Card Categorization
cc = "4175004175004172"

if (cc[0:2]=='34'or'37') and (len(cc)==15):
    print('AMEX')
if (cc[0:2]=='36') and (len(cc)==14):
    print('Diners Club')
if (cc[0:1]=='4') and (len(cc)==16):
    if(cc[0:4]=='4026'or'4405'or'4508'or'4844'or'4913'or'4917') or (cc[0:6]=='417500'):
        print('VISAELECTRON')
    else:
        print('VISA')

VISAELECTRON